/*
B11 ДЗ 5
Перевернуть число
Ввести целое число и «перевернуть» его, так чтобы первая цифра стала последней и т.д.

Данные на входе: Целое неотрицательное число
Данные на выходе: Целое не отрицательное число наоборот

Пример №1
Данные на входе: 1234
Данные на выходе: 4321

Пример №2
Данные на входе:  782
Данные на выходе: 287
*/
#include <stdio.h>

int main(void)
{
    unsigned int n;
    printf("Введите произвольное целое неотрицательное число:\n");
    scanf("%d", &n);

    int reversed = 0;
    while (n > 0)
    {
        reversed = reversed * 10 + n % 10;
        n /= 10; // Удаляем последнюю цифру числа
    }
    printf("Зеркально перевернутое число: %d\n", reversed);
    return 0;
}
